parsing-tech-log/src/Catalogs/СобытияЗамера/СобытияЗамера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СобытияЗамера</name>
  <owners>Catalog.Замеры</owners>
  <attributes>
    <name>Файл</name>
    <type>
      <types>CatalogRef.ФайлыЗамера</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСобытияМкс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьМкс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСобытия</name>
    <type>
      <types>CatalogRef.События</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньСобытия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсеСвойства</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КлючевыеСвойства</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>CatalogRef.Свойства</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ХешЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>28</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

parsing-tech-log/src/Catalogs/СобытияЗамера/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура КлючевыеСвойстваВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСвойство = Элементы.КлючевыеСвойства.ТекущиеДанные.Свойство;
	ТекСтрока = Элементы.КлючевыеСвойства.ТекущиеДанные.Значение;	
	Если МногострочныеСвойства.Получить(ТекСвойство)=Неопределено Тогда 
		ПоказатьВводСтроки(Новый ОписаниеОповещения("ВводСтрокиЗавершение", ЭтотОбъект), ТекСтрока, Строка(ТекСвойство))
	Иначе
		Т = Новый ТекстовыйДокумент();
		Т.ДобавитьСтроку(ТекСтрока);
		Т.Показать(Строка(ТекСвойство));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВводСтрокиЗавершение(Результат, Параметры) Экспорт
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МногострочныеСвойства = СправочникиСерверПовтИсп.МногострочныеСвойства();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсеСвойства(Команда)
	Т = Новый ТекстовыйДокумент();
	Т.ДобавитьСтроку(Объект.ВсеСвойства);
	Т.Показать("Все свойства");
КонецПроцедуры
